Revit 2027 API
FailureDefinitionAccessor.GetApplicableResolutionTypes Method
 Retrieves a list of resolution types applicable to the failure.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public IList<FailureResolutionType> GetApplicableResolutionTypes()
Public Function GetApplicableResolutionTypes As IList(Of FailureResolutionType)
public:
IList<FailureResolutionType>^ GetApplicableResolutionTypes()
member GetApplicableResolutionTypes : unit -> IList<FailureResolutionType>
Return Value
IList<FailureResolutionType>
 The list of resolution types applicable to the failure.
Exceptions
Exception | Condition
InvalidOperationException |  The FailureDefinitionAccessor has not been properly initialized.
See Also
Reference
FailureDefinitionAccessor Class
Autodesk.Revit.DB Namespace